tap "jesseduffield/lazydocker"
tap "oven-sh/bun"
brew "act"
brew "bat"
brew "biome"
brew "btop"
brew "cloc"
brew "fastfetch"
brew "foundry"
brew "fzf"
brew "gh"
brew "git"
brew "hyperfine"
brew "imagemagick"
brew "lsd"
brew "mas"
brew "nvm"
brew "pixi"
brew "ripgrep"
brew "smartmontools"
brew "starship"
brew "stow"
brew "uv"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "jesseduffield/lazydocker/lazydocker"
brew "oven-sh/bun/bun"
cask "1password"
cask "cursor"
cask "discord"
cask "firefox"
cask "google-chrome"
cask "grammarly-desktop"
cask "insomnia"
cask "istat-menus"
cask "iterm2"
cask "jetbrains-toolbox"
cask "libreoffice"
cask "nordvpn"
cask "podman-desktop"
cask "protonvpn"
cask "raycast"
cask "shottr"
cask "slack"
cask "spotify"
cask "superwhisper"
cask "synology-drive"
cask "tableplus"
cask "telegram"
cask "todoist-app"
cask "transmission"
cask "visual-studio-code"
cask "warp"
cask "zed"
cask "zoom"
mas "1Password for Safari", id: 1569813296
mas "Craft", id: 1487937127
mas "Pages", id: 409201541
mas "WhatsApp", id: 310633997
mas "WireGuard", id: 1451685025
mas "Xcode", id: 497799835
vscode "anthropic.claude-code"
vscode "biomejs.biome"
vscode "certora.evmspec-lsp"
vscode "coderabbit.coderabbit-vscode"
vscode "dbaeumer.vscode-eslint"
vscode "denoland.vscode-deno"
vscode "docker.docker"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "framer.framer-syntax"
vscode "ginfuru.ginfuru-better-solarized-dark-theme"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "jakebecker.elixir-ls"
vscode "jebbs.plantuml"
vscode "kilocode.kilo-code"
vscode "luniclynx.lex"
vscode "mads-hartmann.bash-ide-vscode"
vscode "martinring.smt-lib-syntax"
vscode "mikestead.dotenv"
vscode "modular-mojotools.vscode-mojo"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vsliveshare.vsliveshare"
vscode "nomicfoundation.hardhat-solidity"
vscode "pkief.material-icon-theme"
vscode "redhat.java"
vscode "redhat.vscode-commons"
vscode "redhat.vscode-yaml"
vscode "romanrei.material-dark"
vscode "rust-lang.rust-analyzer"
vscode "saoudrizwan.claude-dev"
vscode "shakram02.bash-beautify"
vscode "shanoor.vscode-nginx"
vscode "svelte.svelte-vscode"
vscode "tintinweb.graphviz-interactive-preview"
vscode "tintinweb.solidity-visual-auditor"
vscode "tintinweb.vscode-ethover"
vscode "tintinweb.vscode-inline-bookmarks"
vscode "tintinweb.vscode-solidity-flattener"
vscode "tintinweb.vscode-solidity-language"
vscode "tomoki1207.pdf"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vue.volar"
vscode "wayou.vscode-todo-highlight"
vscode "wix.vscode-import-cost"
