tap "jesseduffield/lazydocker"
tap "oven-sh/bun"
brew "act"
brew "bat"
brew "biome"
brew "btop"
brew "cloc"
brew "fastfetch"
brew "foundry"
brew "fzf"
brew "gh"
brew "git"
brew "hyperfine"
brew "imagemagick"
brew "lsd"
brew "mas"
brew "nvm"
brew "pixi"
brew "ripgrep"
brew "smartmontools"
brew "starship"
brew "stow"
brew "uv"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "jesseduffield/lazydocker/lazydocker"
brew "oven-sh/bun/bun"
cask "1password"
cask "cursor"
cask "discord"
cask "firefox"
cask "google-chrome"
cask "grammarly-desktop"
cask "insomnia"
cask "istat-menus"
cask "iterm2"
cask "jetbrains-toolbox"
cask "libreoffice"
cask "nordvpn"
cask "podman-desktop"
cask "protonvpn"
cask "raycast"
cask "shottr"
cask "slack"
cask "spotify"
cask "superwhisper"
cask "synology-drive"
cask "tableplus"
cask "telegram"
cask "todoist-app"
cask "transmission"
cask "visual-studio-code"
cask "warp"
cask "zed"
cask "zoom"
mas "1Password for Safari", id: 1569813296
mas "Craft", id: 1487937127
mas "Pages", id: 409201541
mas "WhatsApp", id: 310633997
mas "WireGuard", id: 1451685025
mas "Xcode", id: 497799835
vscode "anthropic.claude-code"
vscode "biomejs.biome"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "mikestead.dotenv"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vsliveshare.vsliveshare"
vscode "orta.vscode-jest"
vscode "pkief.material-icon-theme"
vscode "redhat.vscode-yaml"
vscode "rust-lang.rust-analyzer"

